cf/Catalogs/нсиУниверсальныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>нсиУниверсальныйКлассификатор</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.нсиВидыСправочников</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМакет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиШаблоновНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЭлемента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.нсиТипыЭлементовНаименования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНаименования</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.нсиХарактеристикиУниверсальногоСправочника</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрефиксЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПостфиксЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/ChartsOfCharacteristicTypes/нсиХарактеристикиУниверсальногоСправочника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>нсиХарактеристикиУниверсальногоСправочника</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйФункциональныйСправочник</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйКлассификатор</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиУниверсальныйКлассификатор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоКлассификатору</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.нсиНаименованияХарактеристикУниверсальногоСправочника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтПроизводителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СклоненияПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf/ChartsOfCharacteristicTypes/нсиХарактеристикиМТР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>нсиХарактеристикиМТР</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйФункциональныйСправочник</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйКлассификатор</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоКлассификатору</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.нсиНаименованияХарактеристикМТР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтПроизводителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СклоненияПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf/Catalogs/нсиУниверсальныйКлассификатор/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура копирует характеристики из класса ПредметОригинал, копирует шаблон наименования.
// Параметры:
//	ПредметОригинал - ссылка на класс, с которого копируются характеристики.
//
Процедура СкопироватьХарактеристикиОригинала(ПредметОригинал) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	нсиХарактеристикиУниверсальногоСправочника.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.нсиХарактеристикиУниверсальногоСправочника КАК нсиХарактеристикиУниверсальногоСправочника
		|ГДЕ
		|	нсиХарактеристикиУниверсальногоСправочника.Класс = &ПредметОригинал";
	
	Запрос.УстановитьПараметр("ПредметОригинал", ПредметОригинал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Копия характеристики.
		НоваяХарактеристика = ПланыВидовХарактеристик.нсиХарактеристикиМТР.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НоваяХарактеристика, Выборка.Ссылка,, "Код,Класс,Родитель");
		НоваяХарактеристика.УстановитьНовыйКод();
		Если ЭтоНовый() тогда
			НоваяХарактеристика.Класс = ПолучитьСсылкуНового();
		Иначе 	
			НоваяХарактеристика.Класс = Ссылка;
		КонецЕсли;
		НоваяХарактеристика.Записать();
		
		// Замена характеристик в шаблонах наименований.
		НайденыеСтроки = НастройкиШаблоновНаименований.НайтиСтроки(Новый Структура("ЭлементНаименования", Выборка.Ссылка));
		Для Каждого НайденнаяСтрока Из НайденыеСтроки цикл
			НайденнаяСтрока.ЭлементНаименования = НоваяХарактеристика.Ссылка;
		КонецЦикла;	
	КонецЦикла;
		
КонецПроцедуры	

// Процедура копирует или изменяет характеристки текущего класса из класса ПредметМакет.
// Параметры:
//	ПредметМакет - ссылка на класс - источник характеристик.
//
Процедура ОбновитьХарактеристикиПоМакету(ПредметМакет) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	нсиХарактеристикиУниверсальногоСправочникаМакет.Ссылка КАК Макет,
		|	нсиХарактеристикиУниверсальногоСправочникаОригинал.Ссылка КАК Оригинал,
		|   нсиХарактеристикиУниверсальногоСправочникаОригинал.ПометкаУдаления КАК Порядок
		|ИЗ
		|	ПланВидовХарактеристик.нсиХарактеристикиУниверсальногоСправочника КАК нсиХарактеристикиУниверсальногоСправочникаМакет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.нсиХарактеристикиУниверсальногоСправочника КАК нсиХарактеристикиУниверсальногоСправочникаОригинал
		|		ПО нсиХарактеристикиУниверсальногоСправочникаМакет.НаименованиеПоКлассификатору = нсиХарактеристикиУниверсальногоСправочникаОригинал.НаименованиеПоКлассификатору
		|			И (нсиХарактеристикиУниверсальногоСправочникаОригинал.Класс = &ПредметОригинал)
		|ГДЕ
		|	нсиХарактеристикиУниверсальногоСправочникаМакет.Класс = &ПредметМакет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Макет,
		|	Порядок
		|ИТОГИ ПО
		|	Макет";
	
	Запрос.УстановитьПараметр("ПредметМакет", ПредметМакет);
	Запрос.УстановитьПараметр("ПредметОригинал", Ссылка);
	
	ВыборкаМакет = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМакет.Следующий() Цикл
		
		ВыборкаОригинал = ВыборкаМакет.Выбрать();
		Если ВыборкаОригинал.Следующий() Тогда 
			
			Если ВыборкаОригинал.Оригинал = NULL тогда
				ХарактеристикаОбъект = ПланыВидовХарактеристик.нсиХарактеристикиУниверсальногоСправочника.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(ХарактеристикаОбъект, ВыборкаМакет.Макет,, "Код,Класс,Родитель");
				ХарактеристикаОбъект.УстановитьНовыйКод();
				ХарактеристикаОбъект.Класс = Ссылка;
			Иначе 
				ХарактеристикаОбъект = ВыборкаОригинал.Оригинал.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ХарактеристикаОбъект, ВыборкаМакет.Макет,, "Код,Класс,Родитель");
			КонецЕсли;
			
			ХарактеристикаОбъект.Записать();
			
			// Замена характеристик в шаблонах наименований.
			НайденыеСтроки = НастройкиШаблоновНаименований.НайтиСтроки(Новый Структура("ЭлементНаименования", ВыборкаМакет.Макет));
			Для Каждого НайденнаяСтрока Из НайденыеСтроки цикл
				НайденнаяСтрока.ЭлементНаименования = ХарактеристикаОбъект.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

// Процедура удаляет характеристики объекта, если это макет.
//
Процедура УдалитьХарактеристики() Экспорт
	
	Если Не ЭтоМакет тогда
		Возврат
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	нсиХарактеристикиУниверсальногоСправочника.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.нсиХарактеристикиУниверсальногоСправочника КАК нсиХарактеристикиУниверсальногоСправочника
		|ГДЕ
		|	нсиХарактеристикиУниверсальногоСправочника.Класс = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбъектДляУдаления = Выборка.Ссылка.ПолучитьОбъект();	
		ОбъектДляУдаления.ОбменДанными.Загрузка = Истина;
		ОбъектДляУдаления.Удалить();
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийОбъекта

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.нсиУниверсальныйКлассификатор")
		И ДанныеЗаполнения.Владелец = Владелец Тогда
		
		// заполнение реквизитов
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Владелец,Родитель,Код,ЭтоМакет,Идентификатор");
		
		// заполнение табличных частей
		пМетаданные = нсиУниверсальноеХранилище.ПолучитьМетаданные(Владелец);

		ДополнительныеСвойства.Вставить("пМетаданные",пМетаданные);
		
		пОбъект = нсиУниверсальноеХранилище.ПолучитьОбъект(пМетаданные,ДанныеЗаполнения);
		ДополнительныеСвойства.Вставить("Данные",пОбъект);
		
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	нсиУниверсальноеХранилище.МодульОбъектаПередЗаписью(ЭтотОбъект,Отказ);
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
	
	нсиУниверсальноеХранилище.МодульОбъектаПриЗаписи(ЭтотОбъект);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
	
	нсиУниверсальноеХранилище.УдалитьОбъект(Ссылка);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Идентификатор = Справочники.нсиУниверсальныйКлассификатор.ПустаяСсылка().УникальныйИдентификатор();
КонецПроцедуры

#КонецОбласти
